building = {
    'Лесопильный завод': 5,
    'Кирпичный завод': 6,
    'Чугунолитейный завод': 7,
    'Мукомольная мельница': 8,
    'Пекарня': 9,
    'Склад': 10,
    'Амбар': 11,
    'Кузница (устаревшее)': 12,
    'Кузница': 13,
    'Арена': 14,
    'Главное здание': 15,
    'Пункт сбора': 16,
    'Рынок': 17,
    'Посольство': 18,
    'Казарма': 19,
    'Конюшня': 20,
    'Мастерская': 21,
    'Академия': 22,
    'Тайник': 23,
    'Ратуша': 24,
    'Резиденция': 25,
    'Дворец': 26,
    'Сокровищница': 27,
    'Торговая палата': 28,
    'Большая казарма': 29,
    'Большая конюшня': 30,

    'Каменотес': 34,

    'Таверна': 37,
    'Большой склад': 38,
    'Большой амбар': 39,
    'Чудо света': 40,
}

race_building = {'germans': [(32, 'Земляной вал'), (35, 'Пивоварня')]}

resource_building = {
    'Лесопилка': 1,
    'Глиняный карьер': 2,
    'Железный рудник': 3,
    'Ферма': 4
}

r_building = {v: k for k, v in building.items()}
